<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Move Excel package in JAMF PST</string>
		<key>Identifier</key>
		<string>com.github.jherrinjr.APM.Excel.FSLead</string>
		<key>Input</key>
		<dict></dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>applicationTitle</key>
					<string>Excel</string>
					<key>generalPolicyName</key>
					<string>Install Latest Microsoft Excel</string>
					<key>patchSoftwareTitle</key>
					<string>Microsoft Excel 365/2019</string>
					<key>gammaDistributionMethod</key>
					<string>prompt</string>
					<key>productionDelay</key>
					<integer>7</integer>
					<key>prodDistributionMethod</key>
					<string>prompt</string>
				</dict>
				<key>Processor</key>
				<string>com.github.thejacobsales.APM</string>
			</dict>
		</array>
	</dict>
</plist>
