<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Move Zoom package in JAMF PST</string>
		<key>Identifier</key>
		<string>com.github.jherrinjr.APM.Zoom</string>
		<key>Input</key>
		<dict></dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>applicationTitle</key>
					<string>Zoom</string>
					<key>generalPolicyName</key>
					<string>Install Latest Zoom.us</string>
					<key>patchSoftwareTitle</key>
					<string>Zoom Client for Meetings</string>
					<key>gammaDistributionMethod</key>
					<string>prompt</string>
					<key>productionDelay</key>
					<integer>7</integer>
					<key>prodDistributionMethod</key>
					<string>prompt</string>
				</dict>
				<key>Processor</key>
				<string>APM</string>
			</dict>
		</array>
		<key>ParentRecipe</key>
		<string>com.github.jherrinjr.jamf.zoom</string>
	</dict>
</plist>
